app/views/tasks/show.html.erb

SELECT  "grades".* FROM "grades"  WHERE "grades"."task_id" = 3 AND "grades"."user_id" = 1  ORDER BY "grades"."id" ASC LIMIT 1
---
  <strong>Grade:</strong>
  <% @task.grades.where(:user_id => current_user.id).each do |grades| %>

SELECT  "grades".* FROM "grades"  WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
---

  <% if Grade.where(:task_id => @task.id, :user_id => current_user.id).first.nil? %>

SELECT "work_blocks".* FROM "work_blocks"  WHERE "work_blocks"."task_id" = ?  [["task_id", 4]]
---
<strong>Work Blocks:</strong>
<% @task.work_blocks.each do |wb| %>