app/views/courses/add.html.erb


  <% if !current_user.courses.include? @course %>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ? AND "courses"."id" = 1 LIMIT 1  [["user_id", 1]]