app/views/courses/add.html.erb

SELECT  1 AS one FROM "courses" INNER JOIN "courses_admins" ON "courses"."id" = "courses_admins"."course_id" WHERE "courses_admins"."admin_id" = ? AND "courses"."id" = 3 LIMIT 1  [["admin_id", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "courses_admins" ON "courses"."id" = "courses_admins"."course_id" WHERE "courses_admins"."admin_id" = ?  [["admin_id", 1]]
---

  <% if !current_admin.courses.include? @course %>