app/views/courses/index.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_admins" ON "courses"."id" = "courses_admins"."course_id" WHERE "courses_admins"."admin_id" = ?  [["admin_id", 1]]
---
  <tbody>
    <% current_admin.courses.each do |c| %>