app/views/courses/index.html.erb

  <tbody>
    <% current_user.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ?  [["user_id", 1]]