app/views/courses/remove.html.erb

<div>
  <% current_admin.courses.delete(Course.find(params[:id])) %>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 3]]