app/views/courses/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?  [["course_id", 3]]
---
<strong>Students in this class:</strong>
<% @course.users.each do |student| %>

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."course_id" = ?  [["course_id", 3]]
---
<li><strong>Homework:</strong></li>
<% @course.tasks.each do |task| %>

SELECT  "grades".* FROM "grades"  WHERE "grades"."task_id" = 1 AND "grades"."user_id" = 1  ORDER BY "grades"."id" ASC LIMIT 1
---
&nbsp  &nbsp<%= link_to task.name, task_path(task.id) %>
<% g=Grade.where(:task_id => task.id, :user_id => current_user.id).first %>