app/controllers/courses_controller.rb

  def new
    @course = Course.new
    @courses = Course.all
---
SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1

  def create

    @course = Course.new(course_params)
    @courses.users << User.find(params[:user_id]) unless params[:user_id].blank?
---
INSERT INTO "courses" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-17 05:54:31.283929"], ["name", "Java"], ["updated_at", "2014-07-17 05:54:31.283929"]]