app/controllers/grades_controller.rb

SELECT "grades".* FROM "grades"
---
  def index
    @grades = Grade.all

INSERT INTO "grades" ("actual_grade", "created_at", "expected_grade", "task_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["actual_grade", 50], ["created_at", "2014-08-04 14:01:45.752029"], ["expected_grade", 0], ["task_id", 2], ["updated_at", "2014-08-04 14:01:45.752029"], ["user_id", 1]]
---
  def create
    @grade = Grade.new(grade_params)
    @grade.task_id = params[:task_id]
    @grade.user_id = params[:user_id]

    respond_to do |format|
      if @grade.save

SELECT  "grades".* FROM "grades"  WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_grade
      @grade = Grade.find(params[:id])