app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.course_id = params[:course_id]
    respond_to do |format|
      if @task.save
        format.html { redirect_to Course.find(@task.course_id), notice: 'Task was successfully created.' }
---
INSERT INTO "tasks" ("course_id", "created_at", "due_date", "name", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_id", 3], ["created_at", "2014-08-03 06:39:24.628135"], ["due_date", "2014-08-03 06:39:00.000000"], ["name", "fd"], ["type", "Homework"], ["updated_at", "2014-08-03 06:39:24.628135"]]
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 3]]