app/controllers/work_blocks_controller.rb

SELECT "work_blocks".* FROM "work_blocks"
---
  def index
    @work_blocks = WorkBlock.all

INSERT INTO "work_blocks" ("created_at", "end_time", "start_time", "task_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-04 08:22:53.834934"], ["end_time", "2014-08-04 08:22:00.000000"], ["start_time", "2014-08-04 08:22:00.000000"], ["task_id", 4], ["updated_at", "2014-08-04 08:22:53.834934"]]
---
  def create
    @work_block = WorkBlock.new(work_block_params)
    @work_block.task_id = params[:task_id]
    @work_block.user_id = params[:user_id]
    respond_to do |format|
      if @work_block.save

SELECT  "work_blocks".* FROM "work_blocks"  WHERE "work_blocks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_work_block
      @work_block = WorkBlock.find(params[:id])